app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("title", "category", "image", "ingredients", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", ""], ["category", ""], ["image", ""], ["ingredients", ""], ["time", ""], ["created_at", "2019-05-30 21:28:22.361442"], ["updated_at", "2019-05-30 21:28:22.361442"]]

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "category" = $1, "time" = $2, "updated_at" = $3 WHERE "recipes"."id" = $4  [["category", "Breakfast - Lunch"], ["time", "30 - 35 minutes"], ["updated_at", "2019-05-31 18:14:36.968546"], ["id", 1]]

  def destroy
    @recipe.destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 3]]

    def set_recipe
      @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]